// $Id: ViewState_ja.java 116 2008-10-06 10:54:53Z admin $
package jp.co.daifuku.wms.asrs.listbox.carry;

/*
 * Copyright(c) 2000-2007 DAIFUKU Co.,Ltd. All Rights Reserved.
 *
 * This software is the proprietary information of DAIFUKU Co.,Ltd.
 * Use is subject to license terms.
 */

/**
 * ViewStateのキーを定義するクラスです。
 * ここに具体的なクラスの説明を記述して下さい。
 *
 * @version $Revision: 116 $, $Date:: 2008-10-06 19:54:53 +0900#$
 * @author  BusiTune 1.0 Generator.
 * @author  Last commit: $Author: admin $
 */
interface ViewStateKeys
{
    //------------------------------------------------------------
    // fields (upper case only)
    //------------------------------------------------------------
    //
    public static final String STATION_NO_KEY = "STATION_NO_KEY";
    //
    public static final String TERMINAL_NO_KEY = "TERMINAL_NO_KEY";
    //
    public static final String WORK_PLACE_KEY = "WORK_PLACE_KEY";

    //------------------------------------------------------------
    // class variables (prefix '$')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // instance variables (prefix '_')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // constructors
    //------------------------------------------------------------

    //------------------------------------------------------------
    // public methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // accessor methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // package methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // protected methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // private methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // utility methods
    //------------------------------------------------------------

}
//end of class
