// $Id: ViewStateKeys.java,v 1.1.1.1 2009/02/10 08:55:45 arai Exp $
package jp.co.daifuku.wms.retrieval.display.listMnt;

/*
 * Copyright(c) 2000-2007 DAIFUKU Co.,Ltd. All Rights Reserved.
 *
 * This software is the proprietary information of DAIFUKU Co.,Ltd.
 * Use is subject to license terms.
 */

/**
 * ViewStateのキーを定義するクラスです。
 * ここに具体的なクラスの説明を記述して下さい。
 *
 * @version $Revision: 1.1.1.1 $, $Date: 2009/02/10 08:55:45 $
 * @author  BusiTune 1.0 Generator.
 * @author  Last commit: $Author: arai $
 */
interface ViewStateKeys
{
    //------------------------------------------------------------
    // fields (upper case only)
    //------------------------------------------------------------
    //
    public static final String BATCH_NO = "BATCH_NO";
    //
    public static final String FROM_ORDER_NO = "FROM_ORDER_NO";
    //
    public static final String PLAN_DAY = "PLAN_DAY";
    //
    public static final String TO_ORDER_NO = "TO_ORDER_NO";

    //------------------------------------------------------------
    // class variables (prefix '$')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // instance variables (prefix '_')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // constructors
    //------------------------------------------------------------

    //------------------------------------------------------------
    // public methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // accessor methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // package methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // protected methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // private methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // utility methods
    //------------------------------------------------------------

}
//end of class
