// $Id: ViewStateKeys.java 6294 2009-12-02 03:39:10Z kishimoto $
package jp.co.daifuku.wms.retrieval.display.fashortagecomplete;

/*
 * Copyright(c) 2000-2007 DAIFUKU Co.,Ltd. All Rights Reserved.
 *
 * This software is the proprietary information of DAIFUKU Co.,Ltd.
 * Use is subject to license terms.
 */

/**
 * ViewStateのキーを定義するクラスです。
 * ここに具体的なクラスの説明を記述して下さい。
 *
 * @version $Revision: 6294 $, $Date:: 2009-12-02 12:39:10 +0900#$
 * @author  BusiTune 1.0 Generator.
 * @author  Last commit: $Author: kishimoto $
 */
interface ViewStateKeys
{
    //------------------------------------------------------------
    // fields (upper case only)
    //------------------------------------------------------------
    //
    public static final String CONSIGNOR_CODE = "CONSIGNOR_CODE";
    //
    public static final String FROM_TICKET_NO = "FROM_TICKET_NO";
    //
    public static final String TO_TICKET_NO = "TO_TICKET_NO";

    //------------------------------------------------------------
    // class variables (prefix '$')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // instance variables (prefix '_')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // constructors
    //------------------------------------------------------------

    //------------------------------------------------------------
    // public methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // accessor methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // package methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // protected methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // private methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // utility methods
    //------------------------------------------------------------

}
//end of class
