// $Id: ViewStateKeys.java 4424 2009-06-10 07:05:58Z okayama $
package jp.co.daifuku.pcart.retrieval.display.batchstartcancel;

/*
 * Copyright(c) 2000-2007 DAIFUKU Co.,Ltd. All Rights Reserved.
 *
 * This software is the proprietary information of DAIFUKU Co.,Ltd.
 * Use is subject to license terms.
 */

/**
 * ViewStateのキーを定義するクラスです。
 * ここに具体的なクラスの説明を記述して下さい。
 *
 * @version $Revision: 4424 $, $Date:: 2009-06-10 16:05:58 +0900#$
 * @author  BusiTune 1.0 Generator.
 * @author  Last commit: $Author: okayama $
 */
interface ViewStateKeys
{
    //------------------------------------------------------------
    // fields (upper case only)
    //------------------------------------------------------------
    //
    public static final String MASTER_FLAG = "MASTER_FLAG";
    //
    public static final String VS_BATCH_NO = "VS_BATCH_NO";
    //
    public static final String VS_BATCH_SEQ_NO = "VS_BATCH_SEQ_NO";

    //------------------------------------------------------------
    // class variables (prefix '$')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // instance variables (prefix '_')
    //------------------------------------------------------------

    //------------------------------------------------------------
    // constructors
    //------------------------------------------------------------

    //------------------------------------------------------------
    // public methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // accessor methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // package methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // protected methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // private methods
    //------------------------------------------------------------

    //------------------------------------------------------------
    // utility methods
    //------------------------------------------------------------

}
//end of class
